teaching/411-spring-26/411-spring-26.org
#+DATE: 2026-02-12
#+TITLE: Math 411 - Spring 2026
#+SUBTITLE: Introduction to Abstract Algebra 1
#+AUTHOR: Santiago Arango-Piñeros
#+EMAIL: sarangopiner@umass.edu
#+OPTIONS: toc:t num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../org-css.css"/>
#+HTML_HEAD:  <link rel="shortcut icon" type="image/x-icon" href="../../images/umass-favicon.ico">

* Coordinates
** Instructor
[[https://sarangop1728.github.io/][Santiago Arango-Piñeros]], Ph.D. (He/Him).

My office is in *LGRT 1238*, and you can contact me via email at:
+ ~sarangopiner@umass.edu~.

** Graders
+ Natalie Welling (~nwelling@umass.edu~)
+ Sam Silver (~samuelsilver@umass.edu~)
  
** Lectures
|----------------+--------+-------------------+----------|
| /              | <      | <                 | <        |
| Section        | Days   | Time              | Place    |
|----------------+--------+-------------------+----------|
| 02-LEC (80294) | Mo, We | 4:00 PM - 5:15 PM | LGRT 171 |
| 03-LEC (85426) | Mo, We | 5:30 PM - 6:45 PM | LGRT 171 |
|----------------+--------+-------------------+----------|

** Office hours

|--------+-------------------+-----------+---------------|
| /      | <                 | <         | <             |
| Days   | Time              | Place     | By            |
|--------+-------------------+-----------+---------------|
| Mo, We | 3:00 PM - 3:50 PM | LGRT 1522 | Santiago      |
| Fri    | 2:00 PM - 3:50 PM | LGRT 1522 | Natalie & Sam |
|--------+-------------------+-----------+---------------|


If the times above are not convenient, or if you would like to discuss a
private matter, send me an email.

* Course description
The focus of the course will be on studying /groups/. These are algebraic
structures that capture the notion of symmetry. Groups are ubiquitous in all
areas of mathematics and the world around us (see [[*Group theory links][these links]]). If you commit
to this class, you will master the essential concepts of group theory outlined
in the [[*Learning objectives][learning objectives]] by the end of the course.
** Prerequisites
*MATH 235* and either *CMPSCI 250* or *MATH 300*. In other words, we will need
some important concepts from linear algebra, and there will be an emphasis on
proofs and the development of precise mathematical reasoning and writing.

** Textbook
+ */Algebra: Abstract and Concrete/* by Frederick M. Goodman. The book is
  freely available for download at the [[https://homepage.divms.uiowa.edu/~goodman/algebrabook.dir/algebrabook.html][author's website]].
+ As a complement to the textbook, we will use some of [[https://kconrad.math.uconn.edu/blurbs/][Keith Conrad's blurbs]] on
  group theory.
+ Every textbook has strengths and weaknesses. You might find it useful to
  complement your reading with the following resources:
  - Aluffi, [[https://bookstore.ams.org/gsm-104][/Algebra: Chapter 0/]].
  - Dummit and Foote, [[https://books.google.com.co/books/about/Abstract_Algebra.html?id=KJDBQgAACAAJ&redir_esc=y][/Abstract Algebra/]].
  - Macauley, [[https://www.math.clemson.edu/~macaule/visualalgebra.html][/Visual Algebra/]].
  - Terras, [[https://books.google.com.co/books/about/Abstract_Algebra_with_Applications.html?id=znWIDwAAQBAJ&redir_esc=y][/Abstract Algebra with Applications/]].
  - Rotman, [[https://books.google.com.co/books/about/A_First_Course_in_Abstract_Algebra.html?id=ctEZAQAAIAAJ&redir_esc=y][/A First Course in Abstract Algebra/]].

** Learning objectives

1. To learn the fundamental examples of groups. In this class, these are:
   + The finitely generated abelian groups. In particular, the cyclic groups
     \(\mathbb{Z}\) and \(\mathbb{Z}/n\mathbb{Z}\).  
   + The dihedral groups \( D_{n}. \)
   + The symmetric group \( S_{n}. \)
   + The alternating group \( A_{n}. \)
   + The matrix groups \(\mathrm{SO}_2(\mathbb{R}), \mathrm{SO}_3(\mathbb{R}),
     \mathrm{GL}_2(R)\), and \(\mathrm{SL}_2(R)\) for \( R = \mathbb{Z}/n\mathbb{Z}, \mathbb{R} \). 
   + The affine groups \( \mathrm{Aff}_2(R) \) for \( R =
     \mathbb{Z}/n\mathbb{Z}, \mathbb{R} \).

2. To learn the axiomatic definition of a group and how to use it to prove
   basic properties.
3. To learn the concepts of subgroups, cosets, quotients, and how to combine
   these to derive Lagrange’s theorem.
4. To learn the concepts of homomorphisms and isomorphisms and Noether's
   isomorphism theorems.
5. To understand the structure theorem of finitely generated abelian groups in
   terms of the Smith normal form of a matrix with integer coefficients.
6. To learn what it means for a group to act on a set as well as the
   natural actions of each of the fundamental examples.
7. To understand how to use the Sylow theorems.
   
