teaching/411-spring-26/411-spring-26.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-04 Wed 14:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Math 411 - Spring 2026</title>
<meta name="author" content="Santiago Arango-Piñeros" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../org-css.css"/>
<link rel="shortcut icon" type="image/x-icon" href="../../images/umass-favicon.ico">

</head>
<body>
<div id="content" class="content">
<h1 class="title">Math 411 - Spring 2026
<br />
<span class="subtitle">Introduction to Abstract Algebra 1</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0a11a6f">Coordinates</a>
<ul>
<li><a href="#orgb80ae53">Instructor</a></li>
<li><a href="#org52b81a1">Graders</a></li>
<li><a href="#orgf3bdaac">Lectures</a></li>
<li><a href="#orge245453">Office hours</a></li>
</ul>
</li>
<li><a href="#org4881ab2">Course description</a>
<ul>
<li><a href="#org34c834f">Prerequisites</a></li>
<li><a href="#orge079859">Textbook</a></li>
<li><a href="#org7c2eaba">Learning objectives</a></li>
<li><a href="#org6966737">Homework</a></li>
<li><a href="#org7fe1146">Midterm exams (<code>600 points</code>)</a></li>
<li><a href="#orgb697783">Final exam (<code>200 points</code>)</a></li>
<li><a href="#orged844cd">Worksheets (<code>200 points</code>)</a></li>
</ul>
</li>
<li><a href="#org45750c7">Grades</a>
<ul>
<li><a href="#orgfa55799">Mistakes were made policy</a>
<ul>
<li><a href="#org053b32c">Prerequisite: submit a summary</a></li>
<li><a href="#org74f71ca">Submitting corrections</a></li>
<li><a href="#orga4cf485">Grading corrections</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgde64bb7">Topics and schedule</a></li>
<li><a href="#orgf76d748">Group theory links</a></li>
<li><a href="#orgd3e49e8">Philosophy</a>
<ul>
<li><a href="#orga4dec77">Adopt a growth mindset</a></li>
<li><a href="#org0f2dbc9">Learning is the student's responsibility</a></li>
<li><a href="#orgf7d79f0">Doing hard things</a></li>
<li><a href="#orgf46b37b">Everyone belongs in this classroom</a></li>
</ul>
</li>
<li><a href="#org5caee92">Administrative details</a>
<ul>
<li><a href="#orgaf7c923">Drops, withdrawals, and incompletes</a></li>
<li><a href="#org7cecdb8">Make-up exam policy</a></li>
<li><a href="#orgb2feed4">Class attendance policy</a></li>
<li><a href="#orga7b01cc">Class etiquette</a></li>
<li><a href="#org87d51c9">Academic dishonesty</a></li>
</ul>
</li>
<li><a href="#org210b3db">Required statements</a>
<ul>
<li><a href="#org92bc976">Academic honesty statement</a></li>
<li><a href="#org2c821fe">Academic integrity statement</a></li>
<li><a href="#org17dc11e">Accommodation statement</a></li>
<li><a href="#org7869134">Title IX statement</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0a11a6f" class="outline-2">
<h2 id="org0a11a6f">Coordinates</h2>
<div class="outline-text-2" id="text-org0a11a6f">
</div>
<div id="outline-container-orgb80ae53" class="outline-3">
<h3 id="orgb80ae53">Instructor</h3>
<div class="outline-text-3" id="text-orgb80ae53">
<p>
<a href="https://sarangop1728.github.io/">Santiago Arango-Piñeros</a>, Ph.D. (He/Him).
</p>

<p>
My office is in <b>LGRT 1238</b>, and you can contact me via email at:
</p>
<ul class="org-ul">
<li><code>sarangopiner@umass.edu</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org52b81a1" class="outline-3">
<h3 id="org52b81a1">Graders</h3>
<div class="outline-text-3" id="text-org52b81a1">
<ul class="org-ul">
<li>Natalie Welling (<code>nwelling@umass.edu</code>)</li>
<li>Sam Silver (<code>samuelsilver@umass.edu</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf3bdaac" class="outline-3">
<h3 id="orgf3bdaac">Lectures</h3>
<div class="outline-text-3" id="text-orgf3bdaac">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Section</th>
<th scope="col" class="org-left">Days</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Place</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">02-LEC (80294)</td>
<td class="org-left">Mo, We</td>
<td class="org-left">4:00 PM - 5:15 PM</td>
<td class="org-left">LGRT 171</td>
</tr>

<tr>
<td class="org-left">03-LEC (85426)</td>
<td class="org-left">Mo, We</td>
<td class="org-left">5:30 PM - 6:45 PM</td>
<td class="org-left">LGRT 171</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge245453" class="outline-3">
<h3 id="orge245453">Office hours</h3>
<div class="outline-text-3" id="text-orge245453">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Days</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Place</th>
<th scope="col" class="org-left">By</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Mo, We</td>
<td class="org-left">3:00 PM - 3:50 PM</td>
<td class="org-left">LGRT 1522</td>
<td class="org-left">Santiago</td>
</tr>

<tr>
<td class="org-left">Fri</td>
<td class="org-left">3:00 PM - 3:50 PM</td>
<td class="org-left">Zoom (the link is in Canvas)</td>
<td class="org-left">Santiago</td>
</tr>
</tbody>
</table>


<p>
If the times above are not convenient, or if you would like to discuss a
private matter, send me an email.
</p>
</div>
</div>
</div>

<div id="outline-container-org4881ab2" class="outline-2">
<h2 id="org4881ab2">Course description</h2>
<div class="outline-text-2" id="text-org4881ab2">
<p>
The focus of the course will be on studying <i>groups</i>. These are algebraic
structures that capture the notion of symmetry. Groups are ubiquitous in all
areas of mathematics and the world around us (see <a href="#orgf76d748">these links</a>). If you commit
to this class, you will master the essential concepts of group theory outlined
in the <a href="#org7c2eaba">learning objectives</a> by the end of the course.
</p>
</div>
<div id="outline-container-org34c834f" class="outline-3">
<h3 id="org34c834f">Prerequisites</h3>
<div class="outline-text-3" id="text-org34c834f">
<p>
<b>MATH 235</b> and either <b>CMPSCI 250</b> or <b>MATH 300</b>. In other words, we will need
some important concepts from linear algebra, and there will be an emphasis on
proofs and the development of precise mathematical reasoning and writing.
</p>
</div>
</div>

<div id="outline-container-orge079859" class="outline-3">
<h3 id="orge079859">Textbook</h3>
<div class="outline-text-3" id="text-orge079859">
<ul class="org-ul">
<li><b><i>Algebra: Abstract and Concrete</i></b> by Frederick M. Goodman. The book is
freely available for download at the <a href="https://homepage.divms.uiowa.edu/~goodman/algebrabook.dir/algebrabook.html">author's website</a>.</li>
<li>As a complement to the textbook, we will use some of <a href="https://kconrad.math.uconn.edu/blurbs/">Keith Conrad's blurbs</a> on
group theory.</li>
<li>Every textbook has strengths and weaknesses. You might find it useful to
complement your reading with the following resources:
<ul class="org-ul">
<li>Aluffi, <a href="https://bookstore.ams.org/gsm-104"><i>Algebra: Chapter 0</i></a>.</li>
<li>Dummit and Foote, <a href="https://books.google.com.co/books/about/Abstract_Algebra.html?id=KJDBQgAACAAJ&amp;redir_esc=y"><i>Abstract Algebra</i></a>.</li>
<li>Macauley, <a href="https://www.math.clemson.edu/~macaule/visualalgebra.html"><i>Visual Algebra</i></a>.</li>
<li>Terras, <a href="https://books.google.com.co/books/about/Abstract_Algebra_with_Applications.html?id=znWIDwAAQBAJ&amp;redir_esc=y"><i>Abstract Algebra with Applications</i></a>.</li>
<li>Rotman, <a href="https://books.google.com.co/books/about/A_First_Course_in_Abstract_Algebra.html?id=ctEZAQAAIAAJ&amp;redir_esc=y"><i>A First Course in Abstract Algebra</i></a>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7c2eaba" class="outline-3">
<h3 id="org7c2eaba">Learning objectives</h3>
<div class="outline-text-3" id="text-org7c2eaba">
<ol class="org-ol">
<li>To learn the fundamental examples of groups. In this class, these are:
<ul class="org-ul">
<li>The finitely generated abelian groups. In particular, the cyclic groups
\(\mathbb{Z}\) and \(\mathbb{Z}/n\mathbb{Z}\).</li>
<li>The dihedral groups \( D_{n}. \)</li>
<li>The symmetric group \( S_{n}. \)</li>
<li>The alternating group \( A_{n}. \)</li>
<li>The matrix groups \(\mathrm{SO}_2(\mathbb{R}), \mathrm{SO}_3(\mathbb{R}),
     \mathrm{GL}_2(R)\), and \(\mathrm{SL}_2(R)\) for \( R = \mathbb{Z}/n\mathbb{Z}, \mathbb{R} \).</li>
<li>The affine groups \( \mathrm{Aff}_2(R) \) for \( R =
     \mathbb{Z}/n\mathbb{Z}, \mathbb{R} \).</li>
</ul></li>

<li>To learn the axiomatic definition of a group and how to use it to prove
basic properties.</li>
<li>To learn the concepts of subgroups, cosets, quotients, and how to combine
these to derive Lagrange’s theorem.</li>
<li>To learn the concepts of homomorphisms and isomorphisms and Noether's
isomorphism theorems.</li>
<li>To understand the structure theorem of finitely generated abelian groups in
terms of the Smith normal form of a matrix with integer coefficients.</li>
<li>To learn what it means for a group to act on a set as well as the
natural actions of each of the fundamental examples.</li>
<li>To understand how to use the Sylow theorems.</li>
</ol>
</div>
</div>
