teaching/411-spring-26/411-spring-26.org
** Homework 
Homework assignments are a key component of this class. Even though they won't
be graded, the midterm exams will be based on the homework problems. _It is in
your best interest to invest considerable time thinking about the homework
problems._

Collaboration with other students is highly encouraged! Come to office hours to
work on problems with other students.

+ ~PSET0~: Back to basics ([[https://www.dropbox.com/scl/fi/9cq8i56k0c4l8zxx5vrtt/pset0.pdf?rlkey=g8g80z674b1ywms2kkcddybg4&dl=0][~pdf~]])
+ ~PSET1~: Some examples of groups ([[https://www.dropbox.com/scl/fi/t1cjodyterp1oi2o4xy1r/pset1.pdf?rlkey=p1spc9zhe18088o06lj5nu0e4&dl=0][~pdf~]]) 
+ ~PSET2~: Basic properties of groups ([[https://www.dropbox.com/scl/fi/vmtjxwrqpgkuptwz8lywx/pset2.pdf?rlkey=nkuqr7ux74kakw2ffh57i7qax&dl=0][~pdf~]])
+ ~PSET3~: Cosets and Lagrange's theorem 
+ ~PSET4~: The isomorphism theorems
+ ~PSET5~: Direct and semidirect products
+ ~PSET6~: Finitely generated abelian groups
+ ~PSET7~: Group actions and the Sylow theorems

** Midterm exams (~600 points~)
There will be three midterm exams, each one worth ~200 points~. Each exam will
have 5 questions, each one worth ~40 points~. *Question 1* will ask you to
define a concept or state an important theorem. *Question 2* will ask you to
prove a result (of reasonable difficulty) from the corresponding lectures.
*Question 3* will consist of five /True/ or /False/ questions, with no
justification needed. *Question 4* will ask you to perform a computation, and
*Question 5* will be a new problem closely related to the corresponding
~PSETs~. The midterms will be held on Wednesday evenings.

+ ~EXAM1~: Based on lectures 1–5 and ~PSETs~ 0, 1, 2. <2026-02-25 Wed 19:00>.
  Room: ~LGRC A301~.
+ ~EXAM2~: Based on lectures 6–10 and ~PSETs~ 0, 3, 4. <2026-03-25 Wed 19:00>.
  Room: ~LGRC A301~.
+ ~EXAM3~: Based on lectures 11–15 and ~PSETs~ 0, 5, 6.
  <2026-04-15 Wed 19:00>. Room: ~GSMN 51~.
  
See the [[*Mistakes were made policy][``Mistakes were made'' policy]] below.

** Final exam (~200 points~)
This exam evaluates the contents of all lectures and all ~PSETs~, with a
special focus on lectures 16–20 and ~PSETs~ 0, 7. It will consist of four
questions, each one worth ~50 points~.

** Worksheets (~200 points~)
Sometimes, there will be a graded in-class worksheet that evaluates your
understanding of the topics covered during the lecture. I will explain the
solutions at the end of the class, and grade the worksheets only for
completion. If you don't turn in your worksheet, you will get a score of zero.
There are no make-up worksheets, but the 3 lowest scores will be dropped.

* Grades
The perfect final grade is ~1000 points~. To compute your grade, add the scores
obtained in your midterm exams, final exam, and worksheets, and consult the
following tables.

| *Grade*  | A            | A$-$        | B$+$        | B           | B$-$        |
|----------+--------------+-------------+-------------+-------------+-------------|
| /        | <            |             |             |             |             |
| ~points~ | $[930,1000]$ | $[900,930)$ | $[870,900)$ | $[830,870)$ | $[800,830)$ |

| *Grade*  | C$+$        | C           | C$-$        | D$+$        | D           | F         |
|----------+-------------+-------------+-------------+-------------+-------------+-----------|
| /        | <           |             |             |             |             |           |
| ~points~ | $[770,800)$ | $[730,770)$ | $[700,730)$ | $[670,700)$ | $[600,670)$ | $[0,600)$ |

** Mistakes were made policy
With the intention of rewarding behaviors that promote learning, students may
submit corrections to ~EXAM1~, ~EXAM2~, and ~EXAM3~ to _earn back up to 80% of
the points *attempted* and lost_.

*** Prerequisite: submit a summary
To qualify to submit corrections, a student must submit a signed handwritten
summary of the topics assessed on the corresponding exam. The summary must be
uploaded to *Gradescope* before the scheduled exam.
+ Students taking the exam at a different time, for whatever reason, must still
  submit their summaries before the original scheduled exam.

*** Submitting corrections
Corrections are due exactly two weeks after the exam date and must be submitted
through *Gradescope* before midnight.

The correction for each problem must include the following.

1. A complete and correct explanation of your mistake.
2. A complete and correct explanation of a solution.
3. A discussion of what you can do to prevent making this type of mistake again
   in the future.

*** Grading corrections
If the corrections comply with all the requirements listed above, they will be
accepted and the score for the corresponding question on the exam will be
adjusted.

If the corrections fail to comply with *any* of the requirements listed above
(e.g., no summary was presented, or one of items (1), (2), or (3) was not
answered to the grader’s satisfaction), the corrections will be rejected and
the score for the corresponding question on the exam will *not* be adjusted.

