teaching/411-spring-26/411-spring-26.html

<div id="outline-container-org6966737" class="outline-3">
<h3 id="org6966737">Homework</h3>
<div class="outline-text-3" id="text-org6966737">
<p>
Homework assignments are a key component of this class. Even though they won't
be graded, the midterm exams will be based on the homework problems. <span class="underline">It is in
your best interest to invest considerable time thinking about the homework
problems.</span>
</p>

<p>
Collaboration with other students is highly encouraged! Come to office hours to
work on problems with other students.
</p>

<ul class="org-ul">
<li><code>PSET0</code>: Back to basics (<a href="https://www.dropbox.com/scl/fi/9cq8i56k0c4l8zxx5vrtt/pset0.pdf?rlkey=g8g80z674b1ywms2kkcddybg4&amp;dl=0"><code>pdf</code></a>)</li>
<li><code>PSET1</code>: Some examples of groups (<a href="https://www.dropbox.com/scl/fi/t1cjodyterp1oi2o4xy1r/pset1.pdf?rlkey=p1spc9zhe18088o06lj5nu0e4&amp;dl=0"><code>pdf</code></a>)</li>
<li><code>PSET2</code>: Basic properties of groups</li>
<li><code>PSET3</code>: Cosets and Lagrange's theorem</li>
<li><code>PSET4</code>: The isomorphism theorems</li>
<li><code>PSET5</code>: Direct and semidirect products</li>
<li><code>PSET6</code>: Finitely generated abelian groups</li>
<li><code>PSET7</code>: Group actions and the Sylow theorems</li>
</ul>
</div>
</div>

<div id="outline-container-org7fe1146" class="outline-3">
<h3 id="org7fe1146">Midterm exams (<code>600 points</code>)</h3>
<div class="outline-text-3" id="text-org7fe1146">
<p>
There will be three midterm exams, each one worth <code>200 points</code>. Each exam will
have 5 questions, each one worth <code>40 points</code>. <b>Question 1</b> will ask you to
define a concept or state an important theorem. <b>Question 2</b> will ask you to
prove a result (of reasonable difficulty) from the corresponding lectures.
<b>Question 3</b> will consist of five <i>True</i> or <i>False</i> questions, with no
justification needed. <b>Question 4</b> will ask you to perform a computation, and
<b>Question 5</b> will be a new problem closely related to the corresponding
<code>PSETs</code>. The midterms will be held on Wednesday evenings.
</p>

<ul class="org-ul">
<li><code>EXAM1</code>: Based on lectures 1–5 and <code>PSETs</code> 0, 1, 2. <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-25 Wed 19:00&gt;</span></span>.
Room: <code>LGRC A301</code>.</li>
<li><code>EXAM2</code>: Based on lectures 6–10 and <code>PSETs</code> 0, 3, 4. <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-25 Wed 19:00&gt;</span></span>.
Room: <code>LGRC A301</code>.</li>
<li><code>EXAM3</code>: Based on lectures 11–15 and <code>PSETs</code> 0, 5, 6.
<span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-15 Wed 19:00&gt;</span></span>. Room: <code>GSMN 51</code>.</li>
</ul>

<p>
See the <a href="#orgfa55799">``Mistakes were made'' policy</a> below.
</p>
</div>
</div>

<div id="outline-container-orgb697783" class="outline-3">
<h3 id="orgb697783">Final exam (<code>200 points</code>)</h3>
<div class="outline-text-3" id="text-orgb697783">
<p>
This exam evaluates the contents of all lectures and all <code>PSETs</code>, with a
special focus on lectures 16–20 and <code>PSETs</code> 0, 7. It will consist of four
questions, each one worth <code>50 points</code>.
</p>
</div>
</div>

<div id="outline-container-orged844cd" class="outline-3">
<h3 id="orged844cd">Worksheets (<code>200 points</code>)</h3>
<div class="outline-text-3" id="text-orged844cd">
<p>
Sometimes, there will be a graded in-class worksheet that evaluates your
understanding of the topics covered during the lecture. I will explain the
solutions at the end of the class, and grade the worksheets only for
completion. If you don't turn in your worksheet, you will get a score of zero.
There are no make-up worksheets, but the 3 lowest scores will be dropped.
</p>
</div>
</div>
</div>

<div id="outline-container-org45750c7" class="outline-2">
<h2 id="org45750c7">Grades</h2>
<div class="outline-text-2" id="text-org45750c7">
<p>
The perfect final grade is <code>1000 points</code>. To compute your grade, add the scores
obtained in your midterm exams, final exam, and worksheets, and consult the
following tables.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Grade</b></th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">A\(-\)</th>
<th scope="col" class="org-left">B\(+\)</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">B\(-\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>points</code></td>
<td class="org-left">\([930,1000]\)</td>
<td class="org-left">\([900,930)\)</td>
<td class="org-left">\([870,900)\)</td>
<td class="org-left">\([830,870)\)</td>
<td class="org-left">\([800,830)\)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Grade</b></th>
<th scope="col" class="org-left">C\(+\)</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">C\(-\)</th>
<th scope="col" class="org-left">D\(+\)</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">F</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>points</code></td>
<td class="org-left">\([770,800)\)</td>
<td class="org-left">\([730,770)\)</td>
<td class="org-left">\([700,730)\)</td>
<td class="org-left">\([670,700)\)</td>
<td class="org-left">\([600,670)\)</td>
<td class="org-left">\([0,600)\)</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgfa55799" class="outline-3">
<h3 id="orgfa55799">Mistakes were made policy</h3>
<div class="outline-text-3" id="text-orgfa55799">
<p>
With the intention of rewarding behaviors that promote learning, students may
submit corrections to <code>EXAM1</code>, <code>EXAM2</code>, and <code>EXAM3</code> to <span class="underline">earn back up to 80% of
the points <b>attempted</b> and lost</span>.
</p>
</div>

<div id="outline-container-org053b32c" class="outline-4">
<h4 id="org053b32c">Prerequisite: submit a summary</h4>
<div class="outline-text-4" id="text-org053b32c">
<p>
To qualify to submit corrections, a student must submit a signed handwritten
summary of the topics assessed on the corresponding exam. The summary must be
uploaded to <b>Gradescope</b> before the scheduled exam.
</p>
<ul class="org-ul">
<li>Students taking the exam at a different time, for whatever reason, must still
submit their summaries before the original scheduled exam.</li>
</ul>
</div>
</div>

<div id="outline-container-org74f71ca" class="outline-4">
<h4 id="org74f71ca">Submitting corrections</h4>
<div class="outline-text-4" id="text-org74f71ca">
<p>
Corrections are due exactly two weeks after the exam date and must be submitted
through <b>Gradescope</b> before midnight.
</p>

<p>
The correction for each problem must include the following.
</p>

<ol class="org-ol">
<li>A complete and correct explanation of your mistake.</li>
<li>A complete and correct explanation of a solution.</li>
<li>A discussion of what you can do to prevent making this type of mistake again
in the future.</li>
</ol>
</div>
</div>

<div id="outline-container-orga4cf485" class="outline-4">
<h4 id="orga4cf485">Grading corrections</h4>
<div class="outline-text-4" id="text-orga4cf485">
<p>
If the corrections comply with all the requirements listed above, they will be
accepted and the score for the corresponding question on the exam will be
adjusted.
</p>

<p>
If the corrections fail to comply with <b>any</b> of the requirements listed above
(e.g., no summary was presented, or one of items (1), (2), or (3) was not
answered to the grader’s satisfaction), the corrections will be rejected and
the score for the corresponding question on the exam will <b>not</b> be adjusted.
</p>
</div>
</div>
</div>
</div>
