teaching/411-spring-26/411-spring-26.html

<div id="outline-container-orgde64bb7" class="outline-2">
<h2 id="orgde64bb7">Topics and schedule</h2>
<div class="outline-text-2" id="text-orgde64bb7">
<p>
It is the student's responsibility to read the material before the lecture.
During the lectures, we will focus on reviewing the key concepts, answering
questions, and working on examples.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Lecture</th>
<th scope="col" class="org-right">Reading</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-02 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/p1wxilymw0vyhqvnk3z0a/Lecture-1.pdf?rlkey=wz6pvevnvakryws6uz4t8jsgx&amp;st=oihmxpsu&amp;dl=0">1. What is symmetry?</a></td>
<td class="org-right">1.1 - 1.7, <a href="https://kconrad.math.uconn.edu/blurbs/grouptheory/whygroups.pdf">Blurb</a></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-04 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/ye5ewjg4w53js9i9nnlqp/Lecture-2.pdf?rlkey=en0vp8k0mxcdldak8rpebqe5w&amp;st=q1vmzgj1&amp;dl=0">2. Examples of groups</a></td>
<td class="org-right">1.1 - 1.7</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-09 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/5fn0wkb6ejtsk79mqsjpc/Lecture-3.pdf?rlkey=2v43ltzmasna2gk3lyqmmoulk&amp;dl=0">3. Abstract groups: first results</a></td>
<td class="org-right">1.10, 2.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-11 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/17ji5counqyvroky0zxh7/Lecture-4.pdf?rlkey=ihh68st77av0gy3322151n05e&amp;dl=0">4. Subgroups and cyclic groups</a></td>
<td class="org-right">2.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-16 Mon&gt;</span></span></td>
<td class="org-left"><b>No class</b> (Presidents' Day)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-18 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/utckf9w72zu37yaec6f8c/Lecture-5.pdf?rlkey=fe58spmzyrto2y4xmrhr1lbh3&amp;dl=0">5. Dihedral groups</a></td>
<td class="org-right">2.3</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-23 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/c4bwzgfb771pt55lv5r7k/Lecture-6.pdf?rlkey=66e9htb7zs3mo0avx0w6bcezy&amp;dl=0">6. Homomorphisms and isomorphisms</a></td>
<td class="org-right">2.4</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-25 Wed&gt;</span></span></td>
<td class="org-left"><b>Exam 1</b> (no class)</td>
<td class="org-right">Room: <code>LGRC A301</code></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-02 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/4z4br5snua92kfmkyyqha/Lecture-7.pdf?rlkey=red8npkhxxxf51qcykp1rudpy&amp;dl=0">7. The sign of a permutation</a></td>
<td class="org-right"><a href="https://kconrad.math.uconn.edu/blurbs/grouptheory/sign.pdf">Blurb</a></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-04 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/c49t3qqjya7v7pc29tazj/Lecture-8.pdf?rlkey=5qmji57c31u5npkxthnpqr0ya&amp;dl=0">8. Cosets</a></td>
<td class="org-right">2.5</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-09 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/oxt143yka9abuh63wmpfd/Lecture-9.pdf?rlkey=iw757fm7u5t6e1jr5u2xlqy6h&amp;dl=0">9. Lagrange's theorem</a></td>
<td class="org-right">2.5</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-11 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/5umx9xqjvzhxw28wvecpl/Lecture-10.pdf?rlkey=7o83fhinujrhqwrodnnmg0mco&amp;dl=0">10. Noether's isomorphism theorems</a></td>
<td class="org-right">2.7</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-16 Mon&gt;</span></span></td>
<td class="org-left"><b>No class</b> (spring recess)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-18 Wed&gt;</span></span></td>
<td class="org-left"><b>No class</b> (spring recess)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-23 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/yogahfmerlrevbc65y30r/Lecture-11.pdf?rlkey=w71u05arfw3kzyqiehc1ufx7d&amp;dl=0">11. Direct products</a></td>
<td class="org-right">3.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-25 Wed&gt;</span></span></td>
<td class="org-left"><b>Exam 2</b> (no class)</td>
<td class="org-right">Room: <code>LGRC A301</code></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-03-30 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/zekcw3zkkquwxs1zs8rlm/Lecture-12.pdf?rlkey=ooh7llneiqrcpf6reai4xdqc8&amp;dl=0">12. Semidirect products</a></td>
<td class="org-right">3.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-01 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/jhwp7l0ykhttzsk74jsiq/Lecture-13.pdf?rlkey=89ua250me6pwwy68oqcl830t8&amp;dl=0">13. Linear algebra over the integers</a></td>
<td class="org-right">3.5</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-06 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/fsajexd86jw6dg0bhtoyk/Lecture-14.pdf?rlkey=ihw92clet9umsnutu9reqh7qm&amp;dl=0">14. Finitely generated abelian groups</a></td>
<td class="org-right">3.6</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-08 Wed&gt;</span></span></td>
<td class="org-left">15. Elementary divisors decomposition</td>
<td class="org-right">3.6</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-13 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/5qe7hwh5bejcstqb8wihe/Lecture-18.pdf?rlkey=vggwpqmhxmvyfyq5adlhdykk0&amp;dl=0">16. Group actions</a></td>
<td class="org-right">5.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-15 Wed&gt;</span></span></td>
<td class="org-left"><b>Exam 3</b> (no class)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-20 Mon&gt;</span></span></td>
<td class="org-left"><b>No class</b> (Patriot's Day)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-22 Wed&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/5e0ct4ph7dcczk7dbdblx/Lecture-19.pdf?rlkey=ai8rn33avfbgkxzsaq0udtfq7&amp;dl=0">17. Counting orbits</a></td>
<td class="org-right">5.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-27 Mon&gt;</span></span></td>
<td class="org-left"><a href="https://www.dropbox.com/scl/fi/b1lgkyzgax41va73m8dcy/Lecture-20.pdf?rlkey=2wntwn600iv1rs23altpxdm88&amp;dl=0">18. Symmetries of groups</a></td>
<td class="org-right">5.3</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-29 Wed&gt;</span></span></td>
<td class="org-left">19. <a href="https://www.dropbox.com/scl/fi/t8plgi2v2iy9i1xb38pco/Lecture-21.pdf?rlkey=swne53r5vpy94gxow1zqolqy8&amp;dl=0">Group actions and group structure</a></td>
<td class="org-right">5.4</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-05-04 Mon&gt;</span></span></td>
<td class="org-left">20. The Sylow theorems (proofs)</td>
<td class="org-right"><a href="https://kconrad.math.uconn.edu/blurbs/grouptheory/sylowpf.pdf">Blurb</a></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-05-06 Wed&gt;</span></span></td>
<td class="org-left">21. (Problems day, no office hours)</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
