teaching/411-spring-26/411-spring-26.org
* Group theory links
Here are some interesting Wikipedia links to various topics (in math, culture,
and science) related to group theory. I'd be happy to chat about these during
office hours.
+ [[https://en.wikipedia.org/wiki/Rubik%27s_Cube_group][The Rubik’s Cube Group]]
+ [[https://en.wikipedia.org/wiki/15_puzzle][The 15-Puzzle]]
+ [[https://en.wikipedia.org/wiki/Tower_of_Hanoi][The Towers of Hanoi]]
+ [[https://en.wikipedia.org/wiki/Molecular_symmetry][Molecular Symmetry]]
+ [[https://en.wikipedia.org/wiki/Islamic_geometric_patterns][Islamic Geometric Patterns]]
+ [[https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange][The Diffie--Hellman Key Exchange]]
+ [[https://en.wikipedia.org/wiki/Binary_Golay_code][The binary Golay code]]
+ [[https://en.wikipedia.org/wiki/Free_group][Free Groups]]
+ [[https://en.wikipedia.org/wiki/Galois_theory][Galois theory]]
+ [[https://en.wikipedia.org/wiki/Fundamental_group][The Fundamental Group]]
+ [[https://en.wikipedia.org/wiki/Braid_group][Braids and Braid Groups]]
+ [[https://en.wikipedia.org/wiki/Triangle_group][Triangle Groups]]
+ [[https://en.wikipedia.org/wiki/Platonic_solid][Platonic Solids]]
+ [[https://en.wikipedia.org/wiki/Elliptic_curve#The_group_law][Elliptic Curves]]
+ [[https://en.wikipedia.org/wiki/Monster_group][The Monster Group]]

* Philosophy
** Adopt a growth mindset
  Your effort and attitude determine your abilities. Embrace challenges and
  failure as an opportunity to grow. Find inspiration in other people's success.

** Learning is the student's responsibility
Paraphrasing Galileo:
#+BEGIN_QUOTE
``You cannot teach a person *anything*; you can only help
them find it within themselves.''
#+END_QUOTE
We are all here to _understand_. My job as a more experienced learner is to
assist you on your journey. But you are responsible for investing the time and
effort necessary to learn.

** Doing hard things
This is hard work, and it will be frustrating at times. In my opinion, the
reward is well worth the investment, as is often the case with challenging
endeavors. In the words of JFK:
#+BEGIN_QUOTE
``We choose to go to the Moon in this decade and do the other things, not
because they are easy, but because they are hard; because that goal will serve
to organize and measure the best of our energies and skills, because that
challenge is one that we are willing to accept, one we are unwilling to
postpone, and one we intend to win, and the others, too.''
#+END_QUOTE

** Everyone belongs in this classroom
We will subscribe to [[https://www.ams.org/publications/journals/notices/201610/rnoti-p1164.pdf][Federico's axioms]].

+ *Axiom 1.* Mathematical potential is equally present in different groups,
  irrespective of geographic, demographic, and economic boundaries.

+ *Axiom 2.* Everyone can have joyful, meaningful, and empowering mathematical
  experiences.

+ *Axiom 3.* Mathematics is a powerful, malleable tool that can be shaped and
  used differently by various communities to serve their needs.

+ *Axiom 4.* Every student deserves to be treated with dignity and respect.

* Administrative details
- Add/drop only through SPIRE.
- I do not keep a waiting list, and the mathematics department staff will not
  handle these matters.
- Final exams are kept by the mathematics department. Copies are available upon
  request.

** Drops, withdrawals, and incompletes
- Last day to add or drop with no record: <2026-02-04 Wed>.
- Last day to drop with W: <2026-04-02 Thu>.
- See the [[https://www.umass.edu/registrar/academic-calendar][academic calendar]] for other important dates.
- Incomplete grades are warranted only if a student is passing the course at the
  time of the request and if the course requirements can be completed by the
  end of the following semester. Read more [[https://www.umass.edu/natural-sciences/advising/petitions-and-forms/incomplete-grade-form][here]].

** Make-up exam policy
You must take the regular exam unless you qualify for an official make-up exam
approved by me, following the official make-up request procedure. Make sure you
read and understand the make-up exam procedure.

+ *Final exam conflict:* If you need a make-up exam due to a final exam
  schedule conflict, you must submit documentation from the Registrar's Office
  or other supporting documents at least two weeks before the scheduled exams.
  No exceptions will be made. No later than one week before the exam, you must
  submit a written request to me that includes: your name and UMass Amherst
  Student ID number, your section number, and the reason for requesting the
  make-up exam. You can request make-up exams through your SPIRE account: in
  SPIRE, go to Student Home > Final Exam Conflict.

+ *Religious observance:* If you must miss an exam due to religious observance,
  you must contact me within two weeks of the beginning of the semester.

+ *Medical reasons:* If you will be absent from an exam due to medical reasons,
  you must notify me at least one week in advance of the exam. If you have a
  medical emergency, you must notify me as soon as possible. In either case,
  you may need to provide documentation. You do not need to disclose personal
  details of your condition, but you must provide enough information to allow
  the absence to be excused.

+ *Other circumstances:* It is impossible to anticipate all possible
  situations. In the event of an exceptional circumstance not covered above,
  you must contact me and explain the problem. You must be prepared to provide
  a written statement if necessary. I will evaluate the reasons you provide and
  make a decision.

+ Note that there is *no re-taking of exams* in this course. If you are sick
  and take the exam anyway, you cannot re-take the exam later for a better
  grade. Regardless of the situation, if you do not feel you can take the exam
  on the scheduled date, you must inform me as soon as possible.
  
+ Make-up exams will *not* be given to accommodate travel plans.

+ I will ensure that taking a make-up exam does not represent any technical
  advantage. In particular, the questions will be completely different from
  those on the main exam.

** Class attendance policy
By UMass policy, students are expected to attend all regularly scheduled
classes at the University for which they are registered. When planning for the
tests and homework, I will assume that you have been following my lectures.
That being said, I will not enforce or grade attendance. If you are not
able to attend one of the lectures, make sure you read the notes for that
day and talk to other students to check if you missed anything important.

