teaching/411-spring-26/411-spring-26.html

<div id="outline-container-orgf76d748" class="outline-2">
<h2 id="orgf76d748">Group theory links</h2>
<div class="outline-text-2" id="text-orgf76d748">
<p>
Here are some interesting Wikipedia links to various topics (in math, culture,
and science) related to group theory. I'd be happy to chat about these during
office hours.
</p>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Rubik%27s_Cube_group">The Rubik’s Cube Group</a></li>
<li><a href="https://en.wikipedia.org/wiki/15_puzzle">The 15-Puzzle</a></li>
<li><a href="https://en.wikipedia.org/wiki/Tower_of_Hanoi">The Towers of Hanoi</a></li>
<li><a href="https://en.wikipedia.org/wiki/Molecular_symmetry">Molecular Symmetry</a></li>
<li><a href="https://en.wikipedia.org/wiki/Islamic_geometric_patterns">Islamic Geometric Patterns</a></li>
<li><a href="https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange">The Diffie&#x2013;Hellman Key Exchange</a></li>
<li><a href="https://en.wikipedia.org/wiki/Binary_Golay_code">The binary Golay code</a></li>
<li><a href="https://en.wikipedia.org/wiki/Free_group">Free Groups</a></li>
<li><a href="https://en.wikipedia.org/wiki/Galois_theory">Galois theory</a></li>
<li><a href="https://en.wikipedia.org/wiki/Fundamental_group">The Fundamental Group</a></li>
<li><a href="https://en.wikipedia.org/wiki/Braid_group">Braids and Braid Groups</a></li>
<li><a href="https://en.wikipedia.org/wiki/Triangle_group">Triangle Groups</a></li>
<li><a href="https://en.wikipedia.org/wiki/Platonic_solid">Platonic Solids</a></li>
<li><a href="https://en.wikipedia.org/wiki/Elliptic_curve#The_group_law">Elliptic Curves</a></li>
<li><a href="https://en.wikipedia.org/wiki/Monster_group">The Monster Group</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd3e49e8" class="outline-2">
<h2 id="orgd3e49e8">Philosophy</h2>
<div class="outline-text-2" id="text-orgd3e49e8">
</div>
<div id="outline-container-orga4dec77" class="outline-3">
<h3 id="orga4dec77">Adopt a growth mindset</h3>
<div class="outline-text-3" id="text-orga4dec77">
<p>
Your effort and attitude determine your abilities. Embrace challenges and
failure as an opportunity to grow. Find inspiration in other people's success.
</p>
</div>
</div>

<div id="outline-container-org0f2dbc9" class="outline-3">
<h3 id="org0f2dbc9">Learning is the student's responsibility</h3>
<div class="outline-text-3" id="text-org0f2dbc9">
<p>
Paraphrasing Galileo:
</p>
<blockquote>
<p>
``You cannot teach a person <b>anything</b>; you can only help
them find it within themselves.''
</p>
</blockquote>
<p>
We are all here to <span class="underline">understand</span>. My job as a more experienced learner is to
assist you on your journey. But you are responsible for investing the time and
effort necessary to learn.
</p>
</div>
</div>

<div id="outline-container-orgf7d79f0" class="outline-3">
<h3 id="orgf7d79f0">Doing hard things</h3>
<div class="outline-text-3" id="text-orgf7d79f0">
<p>
This is hard work, and it will be frustrating at times. In my opinion, the
reward is well worth the investment, as is often the case with challenging
endeavors. In the words of JFK:
</p>
<blockquote>
<p>
``We choose to go to the Moon in this decade and do the other things, not
because they are easy, but because they are hard; because that goal will serve
to organize and measure the best of our energies and skills, because that
challenge is one that we are willing to accept, one we are unwilling to
postpone, and one we intend to win, and the others, too.''
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgf46b37b" class="outline-3">
<h3 id="orgf46b37b">Everyone belongs in this classroom</h3>
<div class="outline-text-3" id="text-orgf46b37b">
<p>
We will subscribe to <a href="https://www.ams.org/publications/journals/notices/201610/rnoti-p1164.pdf">Federico's axioms</a>.
</p>

<ul class="org-ul">
<li><b>Axiom 1.</b> Mathematical potential is equally present in different groups,
irrespective of geographic, demographic, and economic boundaries.</li>

<li><b>Axiom 2.</b> Everyone can have joyful, meaningful, and empowering mathematical
experiences.</li>

<li><b>Axiom 3.</b> Mathematics is a powerful, malleable tool that can be shaped and
used differently by various communities to serve their needs.</li>

<li><b>Axiom 4.</b> Every student deserves to be treated with dignity and respect.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5caee92" class="outline-2">
<h2 id="org5caee92">Administrative details</h2>
<div class="outline-text-2" id="text-org5caee92">
<ul class="org-ul">
<li>Add/drop only through SPIRE.</li>
<li>I do not keep a waiting list, and the mathematics department staff will not
handle these matters.</li>
<li>Final exams are kept by the mathematics department. Copies are available upon
request.</li>
</ul>
</div>

<div id="outline-container-orgaf7c923" class="outline-3">
<h3 id="orgaf7c923">Drops, withdrawals, and incompletes</h3>
<div class="outline-text-3" id="text-orgaf7c923">
<ul class="org-ul">
<li>Last day to add or drop with no record: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-04 Wed&gt;</span></span>.</li>
<li>Last day to drop with W: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-02 Thu&gt;</span></span>.</li>
<li>See the <a href="https://www.umass.edu/registrar/academic-calendar">academic calendar</a> for other important dates.</li>
<li>Incomplete grades are warranted only if a student is passing the course at the
time of the request and if the course requirements can be completed by the
end of the following semester. Read more <a href="https://www.umass.edu/natural-sciences/advising/petitions-and-forms/incomplete-grade-form">here</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org7cecdb8" class="outline-3">
<h3 id="org7cecdb8">Make-up exam policy</h3>
<div class="outline-text-3" id="text-org7cecdb8">
<p>
You must take the regular exam unless you qualify for an official make-up exam
approved by me, following the official make-up request procedure. Make sure you
read and understand the make-up exam procedure.
</p>

<ul class="org-ul">
<li><b>Final exam conflict:</b> If you need a make-up exam due to a final exam
schedule conflict, you must submit documentation from the Registrar's Office
or other supporting documents at least two weeks before the scheduled exams.
No exceptions will be made. No later than one week before the exam, you must
submit a written request to me that includes: your name and UMass Amherst
Student ID number, your section number, and the reason for requesting the
make-up exam. You can request make-up exams through your SPIRE account: in
SPIRE, go to Student Home &gt; Final Exam Conflict.</li>

<li><b>Religious observance:</b> If you must miss an exam due to religious observance,
you must contact me within two weeks of the beginning of the semester.</li>

<li><b>Medical reasons:</b> If you will be absent from an exam due to medical reasons,
you must notify me at least one week in advance of the exam. If you have a
medical emergency, you must notify me as soon as possible. In either case,
you may need to provide documentation. You do not need to disclose personal
details of your condition, but you must provide enough information to allow
the absence to be excused.</li>

<li><b>Other circumstances:</b> It is impossible to anticipate all possible
situations. In the event of an exceptional circumstance not covered above,
you must contact me and explain the problem. You must be prepared to provide
a written statement if necessary. I will evaluate the reasons you provide and
make a decision.</li>

<li>Note that there is <b>no re-taking of exams</b> in this course. If you are sick
and take the exam anyway, you cannot re-take the exam later for a better
grade. Regardless of the situation, if you do not feel you can take the exam
on the scheduled date, you must inform me as soon as possible.</li>

<li>Make-up exams will <b>not</b> be given to accommodate travel plans.</li>

<li>I will ensure that taking a make-up exam does not represent any technical
advantage. In particular, the questions will be completely different from
those on the main exam.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2feed4" class="outline-3">
<h3 id="orgb2feed4">Class attendance policy</h3>
<div class="outline-text-3" id="text-orgb2feed4">
<p>
By UMass policy, students are expected to attend all regularly scheduled
classes at the University for which they are registered. When planning for the
tests and homework, I will assume that you have been following my lectures.
That being said, I will not enforce or grade attendance. If you are not
able to attend one of the lectures, make sure you read the notes for that
day and talk to other students to check if you missed anything important.
</p>
</div>
</div>
