teaching/411-spring-26/411-spring-26.html

<div id="outline-container-orga7b01cc" class="outline-3">
<h3 id="orga7b01cc">Class etiquette</h3>
<div class="outline-text-3" id="text-orga7b01cc">
<ul class="org-ul">
<li>I expect you to be present and refrain from using your phone.</li>
<li>Arrive on time. If you arrive late, try to minimize your disruption.</li>
<li>Laptops and tablets are allowed during lectures, provided that you do not
disrupt your fellow classmates or the lecture.</li>
</ul>
</div>
</div>

<div id="outline-container-org87d51c9" class="outline-3">
<h3 id="org87d51c9">Academic dishonesty</h3>
<div class="outline-text-3" id="text-org87d51c9">
<p>
Academic dishonesty includes but is not limited to: 
</p>
<ul class="org-ul">
<li><b>Cheating:</b> intentional use, and/or attempted use of trickery, artifice,
deception, breach of confidence, fraud, and/or misrepresentation of one's
academic work.</li>
<li><b>Fabrication:</b> intentional and unauthorized falsification and/or invention of
any information or citation in any academic exercise.</li>
<li><b>Plagiarism:</b> knowingly representing the words or ideas of another as one's
own work in any academic exercise. This includes submitting without citation,
in whole or in part, prewritten term papers of another or the research of
another, including but not limited to commercial vendors who sell or
distribute such materials.</li>
<li><b>Facilitating dishonesty:</b> knowingly helping or attempting to help another
commit an act of academic dishonesty, including substituting for another in
an examination, or allowing others to represent as their own one's papers,
reports, or academic works.</li>
</ul>

<p>
Formal definitions of academic dishonesty, examples of various forms of
dishonesty, and the procedures which faculty must follow to penalize dishonesty
are detailed on the <a href="https://www.umass.edu/studentsuccess/academic-integrity">Academic Honesty website</a>. Appeals must be filed within ten
days of notification by the Academic Honesty Office that a formal charge has
been filed by an instructor who suspects dishonesty. Contact the Academic
Honesty Office for more information on the process. The <a href="https://www.umass.edu/ombuds/">Ombuds Office</a> is also
available to support individuals engaging with the Academic Honesty process.
The <a href="https://www.umass.edu/provost/">Provost’s Office</a> is where appeals are processed and filed.
</p>
</div>
</div>
</div>

<div id="outline-container-org210b3db" class="outline-2">
<h2 id="org210b3db">Required statements</h2>
<div class="outline-text-2" id="text-org210b3db">
</div>
<div id="outline-container-org92bc976" class="outline-3">
<h3 id="org92bc976">Academic honesty statement</h3>
<div class="outline-text-3" id="text-org92bc976">
<p>
Since the integrity of the academic enterprise of any institution of higher
education requires honesty in scholarship and research, academic honesty is
required of all students at the University of Massachusetts Amherst. Academic
dishonesty is prohibited in all programs of the University. Academic dishonesty
includes but is not limited to: cheating, fabrication, plagiarism, and
facilitating dishonesty. Appropriate sanctions may be imposed on any student
who has committed an act of academic dishonesty. Instructors should take
reasonable steps to address academic misconduct. Any person who has reason to
believe that a student has committed academic dishonesty should bring such
information to the attention of the appropriate course instructor as soon as
possible. Instances of academic dishonesty not related to a specific course
should be brought to the attention of the appropriate department head or chair.
Since students are expected to be familiar with this policy and the commonly
accepted standards of academic integrity, ignorance of such standards is not
normally sufficient evidence of lack of intent
(<a href="http://www.umass.edu/dean_students/codeofconduct/acadhonesty/">http://www.umass.edu/dean_students/codeofconduct/acadhonesty/</a>).
</p>
</div>
</div>

<div id="outline-container-org2c821fe" class="outline-3">
<h3 id="org2c821fe">Academic integrity statement</h3>
<div class="outline-text-3" id="text-org2c821fe">
<p>
UMass Amherst is strongly committed to academic integrity, which is defined as
completing all academic work without cheating, lying, stealing, or receiving
unauthorized assistance from any other person, or using any source of
information not appropriately authorized or attributed. As a community, we hold
each other accountable and support each other’s knowledge and understanding of
academic integrity. Academic dishonesty is prohibited in all programs of the
University and includes but is not limited to: cheating, fabrication,
plagiarism, lying, and facilitating dishonesty, via analogue and digital means.
Sanctions may be imposed on any student who has committed or participated in an
academic integrity infraction. Any person who has reason to believe that a
student has committed an academic integrity infraction should bring such
information to the attention of the appropriate course instructor as soon as
possible. All students at the University of Massachusetts Amherst have read and
acknowledged the Commitment to Academic Integrity and are knowingly responsible
for completing all work with integrity and in accordance with the policy:
(<a href="https://www.umass.edu/senate/book/academic-regulations-academic-integrity-policy">https://www.umass.edu/senate/book/academic-regulations-academic-integrity-policy</a>).
</p>
</div>
</div>

<div id="outline-container-org17dc11e" class="outline-3">
<h3 id="org17dc11e">Accommodation statement</h3>
<div class="outline-text-3" id="text-org17dc11e">
<p>
The University of Massachusetts Amherst is committed to providing an equal
educational opportunity for all students. If you have a documented physical,
psychological, or learning disability on file with Disability Services (DS),
you may be eligible for reasonable academic accommodations to help you succeed
in this course. If you have a documented disability that requires an
accommodation, please notify me within the first two weeks of the semester so
that we may make appropriate arrangements. For further information, please
visit Disability Services (<a href="https://www.umass.edu/disability/">https://www.umass.edu/disability/</a>).
</p>
</div>
</div>

<div id="outline-container-org7869134" class="outline-3">
<h3 id="org7869134">Title IX statement</h3>
<div class="outline-text-3" id="text-org7869134">
<p>
In accordance with Title IX of the Education Amendments of 1972 that prohibits
gender-based discrimination in educational settings that receive federal funds,
the University of Massachusetts Amherst is committed to providing a safe
learning environment for all students, free from all forms of discrimination,
including sexual assault, sexual harassment, domestic violence, dating
violence, stalking, and retaliation. This includes interactions in person or
online through digital platforms and social media. Title IX also protects
against discrimination on the basis of pregnancy, childbirth, false pregnancy,
miscarriage, abortion, or related conditions, including recovery. There are
resources on campus to support you. A summary of the available Title IX
resources (confidential and non-confidential) can be found at the following
link: <a href="https://www.umass.edu/titleix/resources">https://www.umass.edu/titleix/resources</a>. You do not need to make a formal
report to access them. If you need immediate support, you are not alone. Free
and confidential support is available 24 hours a day / 7 days a week / 365 days
a year at the SASA Hotline 413-545-0800.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Santiago Arango-Piñeros</p>
<p class="date">Created: 2026-02-04 Wed 14:48</p>
</div>
</body>
</html>
